Импорт данных/Documents/ПродажаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПродажаТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказыКлиентов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиПоФилиалам</xr:Item>
				<xr:Item>AccumulationRegister.КоличествоТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Импорт данных/AccumulationRegisters/КоличествоТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>КоличествоТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Импорт данных/AccumulationRegisters/ПродажиПоФилиалам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиПоФилиалам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Импорт данных/Documents/ПродажаТоваров/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КоличествоТоваров Расход
	Движения.КоличествоТоваров.Записывать = Истина; 
	ТЗ=ПереченьТоваров.Выгрузить();
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
	|	ТЗ.Товар КАК Товар,
	|	ТЗ.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.Товар КАК Товар,
	|	ВТ_ТоварыДокумента.Количество КАК Количество,
	|	ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КоличествоТоваровОстатки.КоличествоОстаток, 0) < ВТ_ТоварыДокумента.Количество
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Проверка
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КоличествоТоваров.Остатки(&Период, Филиал = &Филиал) КАК КоличествоТоваровОстатки
	|		ПО ВТ_ТоварыДокумента.Товар = КоличествоТоваровОстатки.Товар";
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Результат=Запрос.Выполнить();
	Выборка=Результат.Выгрузить();
	//ПереченьТоваров.Загрузить(Выборка);
	//формирование таблицы для проверки
	ТаблицаДляПроверки=Выборка.Скопировать();
	ТаблицаДляПроверки.Свернуть("Проверка");
	//Проверка
	ЕстьНехватки=Ложь; //Товара хватает
	Если ТаблицаДляПроверки.Количество()=1  Тогда 
		Если ТаблицаДляПроверки[0].Проверка=Истина Тогда
			ЕстьНехватки=Ложь; //Товара  в строке хватает 		
		Иначе
			ЕстьНехватки=Истина; //Товара  в строке не хватает		
		КонецЕсли;	
	Иначе
		ЕстьНехватки=Истина; //товара по одной или нескольким строчкам не хватает	
	КонецЕсли;
	Если Не ЕстьНехватки Тогда//	ЕстьНехватки=Ложь  - товара достаточно 
		//товара достаточно - разрешаем движения	
		Для Каждого Стр Из Выборка Цикл
			Движение = Движения.КоличествоТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = Стр.Товар;
			Движение.Филиал = Филиал;
			Движение.Количество = Стр.Количество;
		КонецЦикла;
	Иначе
		Отказ=Истина; //запрет проведения
		//сообщение по каждой нехватки товара
		Для каждого Стр Из Выборка Цикл
			Если Не Стр.Проверка Тогда
				Сообщить("Товара "+Стр.Товар+" не хватает в количестве "+(Стр.Количество-Стр.Остаток));
			КонецЕсли;	  
		КонецЦикла;
	КонецЕсли; 
	// регистр ПродажиПоФилиалам 
	Движения.ПродажиПоФилиалам.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
		Движение = Движения.ПродажиПоФилиалам.Добавить();
		Движение.Период = Дата;
		Движение.Филиал = Филиал;
		Движение.Менеджер = Менеджер;
		Движение.Сумма = ТекСтрокаПереченьТоваров.Сумма;
	КонецЦикла;
	

//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказыКлиентов") Тогда
		// Заполнение шапки
		Менеджер = ДанныеЗаполнения.Менеджер;
		Филиал = ДанныеЗаполнения.Филиал;
		Фирма = ДанныеЗаполнения.Фирма;
		Для Каждого ТекСтрокаПереченьТоваров Из ДанныеЗаполнения.ПереченьТоваров Цикл
			НоваяСтрока = ПереченьТоваров.Добавить();
			НоваяСтрока.Количество = ТекСтрокаПереченьТоваров.Количество;
			НоваяСтрока.Товар = ТекСтрокаПереченьТоваров.Товар;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
